[
  {
    "id": 1,
    "username": "joao_g_fs",
    "email": "juau@gmail.com",
    "senha": "$2b$10$mt677BBdwr.r.ADyPxM8qu9bDPd0..QjIlhyXG4OaVAHWKqfyVSpK",
    "assistir": [
      {
        "id": 4233,
        "poster_path": "/zqDrfOJ0ChhYFyv3iQyTgNZGs2B.jpg",
        "release_date": "1997-12-12",
        "title": "Pânico 2",
        "overview": "Dois anos após o massacre em Woodsboro, Sidney Prescott e Randy Meeks estão tentando refazer suas vidas em uma nova cidade. Estudando no colégio de Windsor, eles vão lidar com uma nova onda de assassinatos quando o terrível psicopata retorna para assombrá-los nas vésperas do lançamento do filme baseado nos seus crimes."
      },
      {
        "id": 1022789,
        "poster_path": "/9h2KgGXSmWigNTn3kQdEFFngj9i.jpg",
        "release_date": "2024-06-11",
        "title": "Divertida Mente 2",
        "overview": "\"Divertida Mente 2\", da Disney e da Pixar, retorna à mente da adolescente Riley, e o faz no momento em que a sala de comando está passando por uma demolição repentina para dar lugar a algo totalmente inesperado: novas emoções! Alegria, Tristeza, Raiva, Medo e Nojinho não sabem bem como reagir quando Ansiedade aparece, e tudo indica que ela não está sozinha."
      }
    ],
    "assistidos": [
      {
        "id": 273248,
        "poster_path": "/jfTo9U9OgOXODEEspNnYFuZdR1q.jpg",
        "release_date": "2015-12-25",
        "title": "Os Oito Odiados",
        "overview": "Durante uma nevasca, um carrasco, uma prisioneira, um caçador de recompensas e um homem que alega ser xerife buscam abrigo no Armazém da Minnie, onde quatro outros desconhecidos estão abrigados. Aos poucos, os oito viajantes no local começam a descobrir os segredos sangrentos uns dos outros, levando a um inevitável confronto entre eles.",
        "nota": "5",
        "resenha": "Ótimo filme, com suspense e ótimos diálogos.\nAção bem feita e o final sangrento típico do Tarantino."
      },
      {
        "id": 24,
        "poster_path": "/v7TaX8kXMXs5yFFGR41guUDNcnB.jpg",
        "release_date": "2003-10-10",
        "title": "Kill Bill: Volume 1",
        "overview": "A ex-assassina conhecida apenas como \"A Noiva\" acorda de um coma de quatro anos decidida a se vingar de Bill, seu ex-amante e chefe, que tentou matá-la no dia do casamento. Ela está motivada a acertar as contas com cada uma das pessoas envolvidas com a perda da filha, da festa de casamento e dos quatro anos da sua vida. Na jornada, \"A Noiva\" é submetida a dores físicas agoniantes ao enfrentar a inescrupulosa gangue de Bill, o Esquadrão Assassino de Víboras Mortais.",
        "nota": "3",
        "resenha": "Da hora"
      },
      {
        "id": 64690,
        "poster_path": "/602vevIURmpDfzbnv5Ubi6wIkQm.jpg",
        "release_date": "2011-09-15",
        "title": "Drive",
        "overview": "Um motorista habilidoso é dublê em Hollywood e piloto de fuga em assaltos. Quando aceita ajudar o marido de sua vizinha Irene, fica na mira dos homens mais perigosos de LA. Mas o trabalho dá errado, e a única forma de garantir a segurança de Irene e do filho é fazer o que ele faz de melhor: dirigir.",
        "nota": "3",
        "resenha": "Eu draivo"
      }
    ]
  },
  {
    "id": 2,
    "username": "jerson",
    "email": "jgs@gm.ca",
    "senha": "$2b$10$i37sxiixQHhWAn61/vm1yOJMLllt3mJjbhmy/RyKR9jv5X/xGrUby",
    "assistir": [],
    "assistidos": []
  },
  {
    "id": 3,
    "username": "jg",
    "email": "joaogfs@bol.br",
    "senha": "$2b$10$pxinITLKNwtWw4VPZCUaVuNGsNTUYAh8xOd6G/rIHIvVsAdVs916S",
    "assistir": [],
    "assistidos": []
  },
  {
    "id": 4,
    "username": "joaozin",
    "email": "a@h.c",
    "senha": "$2b$10$evZdxVKAWd4yig0I6pUpiOs56L5t2VICkFTWCuGYyLkTjSc/UePLu",
    "assistir": [],
    "assistidos": []
  },
  {
    "id": 5,
    "username": "pvrodrigues10",
    "email": "paulovitor-cr@hotmail.com",
    "senha": "$2b$10$X9wvyjywCFeGODQruJFmBeodIRuo9eMk3rJxFUbIbLq8/fff2Vb2K",
    "assistir": [
      {
        "id": 181808,
        "poster_path": "/5dGufuaIG5vNcxPm8QPij5MSPeQ.jpg",
        "release_date": "2017-12-13",
        "title": "Star Wars: Episódio VIII - Os Últimos Jedi",
        "overview": "A tranquila e solitária vida de Luke Skywalker sofre uma reviravolta quando ele conhece Rey, uma jovem que mostra fortes sinais da Força. O desejo dela de aprender o estilo dos Jedi força Luke a tomar uma decisão que mudará sua vida para sempre. Enquanto isso, Kylo Ren e o General Hux lideram a Primeira Ordem para um ataque total contra Leia e a Resistência pela supremacia da galáxia."
      },
      {
        "id": 181812,
        "poster_path": "/uLlrDUtFG2tKtDcJN6kBznlqqsp.jpg",
        "release_date": "2019-12-18",
        "title": "Star Wars: Episódio IX - A Ascensão Skywalker",
        "overview": "Com o retorno do Imperador Palpatine, todos voltam a temer seu poder e, com isso, a Resistência toma a frente da batalha que ditará os rumos da galáxia. Treinando para ser uma completa Jedi, Rey (Daisy Ridley) ainda se encontra em conflito com seu passado e futuro, mas teme pelas respostas que pode conseguir a partir de sua complexa ligação com Kylo Ren (Adam Driver), que também se encontra em conflito pela Força."
      },
      {
        "id": 140607,
        "poster_path": "/lqMDbo4rXnakFgc4C6LzPv6pG7F.jpg",
        "release_date": "2015-12-15",
        "title": "Star Wars: O Despertar da Força",
        "overview": "A queda de Darth Vader e do Império levou ao surgimento de uma nova força sombria: a Primeira Ordem. Eles procuram o jedi Luke Skywalker, desaparecido. A resistência tenta desesperadamente encontrá-lo antes para salvar a galáxia."
      }
    ],
    "assistidos": [
      {
        "id": 348350,
        "poster_path": "/jAMEX0syUh6sbjBiysibzrFpbo.jpg",
        "release_date": "2018-05-15",
        "title": "Han Solo: Uma História Star Wars",
        "overview": "Embarque na Millennium Falcon e viaje para uma galáxia distante em uma nova aventura com o mais amado canalha da galáxia. Através de uma série de ousadas aventuras no obscuro e perigoso submundo do crime, Han Solo encontra seu poderoso futuro copiloto Chewbacca e encontra o famoso jogador Lando Calrissian, em uma jornada que definirá o curso de um dos heróis mais improváveis da saga Star Wars.",
        "nota": "5",
        "resenha": "muito bom"
      }
    ]
  },
  {
    "id": 6,
    "username": "hiarafg",
    "email": "hiara@gmail.com",
    "senha": "$2b$10$/qW1VbZXXb3wIIapYyqy9eJ64YrGQuhpM5SkdPqXr5xeMcJEcfFWS",
    "assistir": [
      {
        "id": 1022789,
        "poster_path": "/9h2KgGXSmWigNTn3kQdEFFngj9i.jpg",
        "release_date": "2024-06-11",
        "title": "Divertida Mente 2",
        "overview": "\"Divertida Mente 2\", da Disney e da Pixar, retorna à mente da adolescente Riley, e o faz no momento em que a sala de comando está passando por uma demolição repentina para dar lugar a algo totalmente inesperado: novas emoções! Alegria, Tristeza, Raiva, Medo e Nojinho não sabem bem como reagir quando Ansiedade aparece, e tudo indica que ela não está sozinha."
      },
      {
        "id": 37165,
        "poster_path": "/5lnCIDrH6yujeuJ16CGPoFktKd6.jpg",
        "release_date": "1998-06-04",
        "title": "O Show de Truman: O Show da Vida",
        "overview": "Truman Burbank é um pacato vendedor de seguros que leva um vida simples com sua esposa Meryl Burbank. Porém algumas coisas ao seu redor fazem com que ele passe a estranhar sua cidade, seus supostos amigos e até sua mulher. Após conhecer a misteriosa Lauren, ele fica intrigado e acaba descobrindo que toda sua vida foi monitorada por câmeras e transmitida em rede nacional."
      }
    ],
    "assistidos": [
      {
        "id": 965150,
        "poster_path": "/xjOVvfI8aRKQNvSbFJgGTyampn9.jpg",
        "release_date": "2022-10-21",
        "title": "Aftersun",
        "overview": "Em um resort decadente, Sophie, de 11 anos, aproveita o raro tempo com seu pai amoroso e idealista, Calum. Vinte anos depois, as lembranças de Sophie de suas últimas férias se tornam um retrato poderoso e doloroso do relacionamento deles.",
        "nota": "5",
        "resenha": "Filme bem profundo, mostrando as memórias das férias de Sophie com seu pai, seus conflitos internos, muito sentimental e delicado. Conseguiu expressar sentimentos em cada diálogo e olhar entre os personagens, filme maravilhoso."
      }
    ]
  }
]